#include <stdio.h>
int main(void)
{
	float i,bonus;
	printf("请输入利润\n");
	scanf("%f",&i);
	if (i>1000000)
	{
		bonus=100000*(0.1+0.075)+200000*(0.05+0.03)+400000*0.015+(i-1000000)*0.01;
	}
	else if (i>600000)
	{
		bonus=100000*(0.1+0.075)+200000*(0.05+0.03)+(i-600000)*0.015;
	}
	else if (i>400000)
	{
		bonus=100000*(0.1+0.075)+200000*0.05+(i-400000)*0.03;
	}
	else if (i>200000)
	{
		bonus=100000*(0.1+0.075)+(i-200000)*0.05;
	}
	else if (i>100000)
	{
		bonus=100000*0.1+(i-100000)*0.075;
	}
	else
	{
		bonus=i*0.1;
	}
	printf("应发奖金为%.2f",bonus);
	return 0;
}